### Imports

In [1]:
import pandas as pd
import glob
import os

### Opening DFs

In [2]:
# ADI
df_adi = pd.read_csv('D:/UCLA/Capstone/HMS-MGH-Capstone-Project/datasets/ADI/US_2020_ADI_Census Block Group_v4.csv')
df_adi.head()

   Unnamed: 0  X.1  X          GISJOIN ADI_NATRANK ADI_STATERNK         FIPS
0           1    1  1  G01000100201001          66            4  10010201001
1           2    2  2  G01000100201002          66            4  10010201002
2           3    3  3  G01000100202001          88            7  10010202001
3           4    4  4  G01000100202002          88            7  10010202002
4           5    5  5  G01000100203001          75            5  10010203001

In [3]:
# AHD AK to IA

all_ahd_files = glob.glob('D:/UCLA/Capstone/HMS-MGH-Capstone-Project/datasets/AHD_Data/AK_to_IA/' + "*.csv")
all_ahd_files = [f.replace("\\", "/") for f in all_ahd_files]

ahd_AK_to_IA_dfs = []
for filename in all_ahd_files:
    df = pd.read_csv(filename)
    ahd_AK_to_IA_dfs.append(df)

ahd_AK_to_IA_dfs[0].head()

,Unnamed: 0,State,Hospital_Name,City,Staffed_Beds,Total_Discharges,Patient_Days,Gross_Patient_Revenue
0,0,AK,673d Medical Group - Joint Base Elmendorf-Rich...,Joint Base Elmendorf-Richardson,0,0,0,$0
1,1,AK,Alaska Native Medical Center,Anchorage,174,"8,079","40,053",$0
2,2,AK,Alaska Regional Hospital,Anchorage,176,"7,205","42,868","$1,749,027"
3,3,AK,Bartlett Regional Hospital,Juneau,57,"1,506","8,091","$212,228"
4,4,AK,Bassett Army Community Hospital,Fort Wainwright,0,0,0,$0

In [4]:
# AHD ID to MP

all_ahd_files = glob.glob('D:/UCLA/Capstone/HMS-MGH-Capstone-Project/datasets/AHD_Data/ID_to_MP/' + "*.csv")
all_ahd_files = [f.replace("\\", "/") for f in all_ahd_files]

ahd_ID_to_MP_dfs = []
for filename in all_ahd_files:
    df = pd.read_csv(filename)
    ahd_ID_to_MP_dfs.append(df)

ahd_ID_to_MP_dfs[0].head()

,Unnamed: 0,State,Hospital_Name,City,Staffed_Beds,Total_Discharges,Patient_Days,Gross_Patient_Revenue
0,0,ID,Boise VA Medical Center,Boise,0,0,0,$0
1,1,ID,Eastern Idaho Regional Medical Center,Idaho Falls,290,"9,278","53,648","$1,716,791"
2,2,ID,Grove Creek Medical Center,Blackfoot,8,396,"1,474","$6,436"
3,3,ID,Idaho Falls Community Hospital,Idaho Falls,88,"2,110","10,066","$219,528"
4,4,ID,Kootenai Health,Coeur d'Alene,329,"14,813","88,949","$1,660,832"

In [5]:
# AHD MS to PA

all_ahd_files = glob.glob('D:/UCLA/Capstone/HMS-MGH-Capstone-Project/datasets/AHD_Data/MS_to_PA/' + "*.csv")
all_ahd_files = [f.replace("\\", "/") for f in all_ahd_files]

ahd_MS_to_PA_dfs = []
for filename in all_ahd_files:
    df = pd.read_csv(filename)
    ahd_MS_to_PA_dfs.append(df)

ahd_MS_to_PA_dfs[0].head()

,Unnamed: 0,State,Hospital_Name,City,Staffed_Beds,Total_Discharges,Patient_Days,Gross_Patient_Revenue
0,0,MS,81st Medical Group - Keesler Medical Center,Keesler Air Force Base,0,0,0,$0
1,1,MS,Alliance Health Center,Meridian,154,912,"5,585","$82,038"
2,2,MS,Alliance Healthcare Hospital,Holly Springs,0,0,0,$0
3,3,MS,Anderson Regional Medical Center,Meridian,270,"8,003","37,979","$761,876"
4,4,MS,Anderson Regional Medical Center South,Meridian,69,1,1,"$53,840"

In [6]:
# AHD PR to WY

all_ahd_files = glob.glob('D:/UCLA/Capstone/HMS-MGH-Capstone-Project/datasets/AHD_Data/PR_to_WY/' + "*.csv")
all_ahd_files = [f.replace("\\", "/") for f in all_ahd_files]

ahd_PR_to_WY_dfs = []
for filename in all_ahd_files:
    df = pd.read_csv(filename)
    ahd_PR_to_WY_dfs.append(df)

ahd_PR_to_WY_dfs[0].head()

,Unnamed: 0,State,Hospital_Name,City,Staffed_Beds,Total_Discharges,Patient_Days,Gross_Patient_Revenue
0,0,PR,Ashford Hospital,San Juan,173,"7,683","40,742","$93,840"
1,1,PR,Auxilio Mutuo Hospital of Puerto Rico,Hato Rey,500,"14,306","93,369","$401,601"
2,2,PR,Bayamon Medical Center,Bayamon,253,"8,584","44,862","$107,124"
3,3,PR,Bayamon Regional Hospital,Bayamon,140,"1,578","38,279","$11,576"
4,4,PR,Bella Vista Hospital,Mayaguez,183,"3,689","19,436","$68,775"

In [7]:
# State Covid Cases
df_cases = pd.read_csv('D:/UCLA/Capstone/HMS-MGH-Capstone-Project/datasets/covid_data/us_state_confirmed_case.csv')
df_cases.head()

,Right_STATE,state,POP90,POP80,POP70,POP10,POP00,NAME,HHD90,HHD80,...,2023-03-14,2023-03-15,2023-03-16,2023-03-17,2023-03-18,2023-03-19,2023-03-20,2023-03-21,2023-03-22,2023-03-23
0,1,Alabama,4040576,3886040,3434507,4779736,4447059,Alabama,1506778,1340563,...,1644533,1646423,1646423,1646423,1646423,1646423,1646423,1646423,1648385,1648385
1,2,Alaska,549808,393155,225211,710231,626932,Alaska,188909,130004,...,308399,308399,308399,308399,308399,308399,308399,308893,308893,308893
2,4,Arizona,3663266,2705322,1768275,6392017,5130674,Arizona,1368775,953006,...,2444144,2448406,2448406,2448406,2448406,2448406,2448406,2448406,2451062,2451062
3,5,Arkansas,2350107,2253450,1901082,2915918,2673393,Arkansas,891049,805730,...,1007474,1007474,1007940,1008303,1008303,1008303,1008303,1008303,1008303,1008303
4,6,California,29724503,23575384,19838084,37253956,33871650,California,10377409,8624938,...,12135588,12136243,12152129,12153079,12153079,12153083,12154293,12154941,12155467,12169158

In [8]:
# State Covid Deaths
df_deaths = pd.read_csv('D:/UCLA/Capstone/HMS-MGH-Capstone-Project/datasets/covid_data/us_state_confirmed_deaths.csv')
df_deaths.head()

,Right_STATE,state,POP90,POP80,POP70,POP10,POP00,NAME,HHD90,HHD80,...,2023-03-14,2023-03-15,2023-03-16,2023-03-17,2023-03-18,2023-03-19,2023-03-20,2023-03-21,2023-03-22,2023-03-23
0,1,Alabama,4040576,3886040,3434507,4779736,4447059,Alabama,1506778,1340563,...,21570,21612,21612,21612,21612,21612,21612,21612,21631,21631
1,2,Alaska,549808,393155,225211,710231,626932,Alaska,188909,130004,...,1438,1438,1438,1438,1438,1438,1438,1438,1438,1438
2,4,Arizona,3663266,2705322,1768275,6392017,5130674,Arizona,1368775,953006,...,33104,33158,33158,33158,33158,33158,33158,33158,33190,33190
3,5,Arkansas,2350107,2253450,1901082,2915918,2673393,Arkansas,891049,805730,...,13038,13038,13060,13068,13068,13068,13068,13068,13068,13068
4,6,California,29724503,23575384,19838084,37253956,33871650,California,10377409,8624938,...,104038,104047,104114,104130,104130,104130,104165,104185,104196,104277

### Merging DFs

In [9]:
df_deaths_cases = df_cases.merge(df_deaths, on='state', how='inner')
df_deaths_cases.head()

,Right_STATE_x,state,POP90_x,POP80_x,POP70_x,POP10_x,POP00_x,NAME_x,HHD90_x,HHD80_x,...,2023-03-14_y,2023-03-15_y,2023-03-16_y,2023-03-17_y,2023-03-18_y,2023-03-19_y,2023-03-20_y,2023-03-21_y,2023-03-22_y,2023-03-23_y
0,1,Alabama,4040576,3886040,3434507,4779736,4447059,Alabama,1506778,1340563,...,21570,21612,21612,21612,21612,21612,21612,21612,21631,21631
1,2,Alaska,549808,393155,225211,710231,626932,Alaska,188909,130004,...,1438,1438,1438,1438,1438,1438,1438,1438,1438,1438
2,4,Arizona,3663266,2705322,1768275,6392017,5130674,Arizona,1368775,953006,...,33104,33158,33158,33158,33158,33158,33158,33158,33190,33190
3,5,Arkansas,2350107,2253450,1901082,2915918,2673393,Arkansas,891049,805730,...,13038,13038,13060,13068,13068,13068,13068,13068,13068,13068
4,6,California,29724503,23575384,19838084,37253956,33871650,California,10377409,8624938,...,104038,104047,104114,104130,104130,104130,104165,104185,104196,104277

In [10]:
state_abbreviations = {
    'Alaska': 'AK',
    'Alabama': 'AL',
    'Arkansas': 'AR',
    'Arizona': 'AZ',
    'California': 'CA',
    'Colorado': 'CO',
    'Connecticut': 'CT',
    'District of Columbia': 'DC',
    'Delaware': 'DE',
    'Florida': 'FL',
    'Georgia': 'GA',
    'Hawaii': 'HI',
    'Iowa': 'IA',
    'Idaho': 'ID',
    'Illinois': 'IL',
    'Indiana': 'IN',
    'Kansas': 'KS',
    'Kentucky': 'KY',
    'Louisiana': 'LA',
    'Massachusetts': 'MA',
    'Maryland': 'MD',
    'Maine': 'ME',
    'Michigan': 'MI',
    'Minnesota': 'MN',
    'Missouri': 'MO',
    'Mississippi': 'MS',
    'Montana': 'MT',
    'North Carolina': 'NC',
    'North Dakota': 'ND',
    'Nebraska': 'NE',
    'New Hampshire': 'NH',
    'New Jersey': 'NJ',
    'New Mexico': 'NM',
    'Nevada': 'NV',
    'New York': 'NY',
    'Ohio': 'OH',
    'Oklahoma': 'OK',
    'Oregon': 'OR',
    'Pennsylvania': 'PA',
    'Puerto Rico': 'PR',
    'Rhode Island': 'RI',
    'South Carolina': 'SC',
    'South Dakota': 'SD',
    'Tennessee': 'TN',
    'Texas': 'TX',
    'Utah': 'UT',
    'Virginia': 'VA',
    'Vermont': 'VT',
    'Washington': 'WA',
    'Wisconsin': 'WI',
    'West Virginia': 'WV',
    'Wyoming': 'WY'
}

In [11]:
df_deaths_cases['State'] = df_deaths_cases['state'].map(state_abbreviations)

In [12]:
ahd_AK_to_IA_dfs[0]['State']

0     AK
1     AK
2     AK
3     AK
4     AK
5     AK
6     AK
7     AK
8     AK
9     AK
10    AK
Name: State, dtype: object

In [13]:
df_main = df_deaths_cases

In [14]:
# Concatenating the DataFrames within each list
ahd_AK_to_IA_dfs = pd.concat(ahd_AK_to_IA_dfs, ignore_index=True)
ahd_ID_to_MP_dfs = pd.concat(ahd_ID_to_MP_dfs, ignore_index=True)
ahd_MS_to_PA_dfs = pd.concat(ahd_MS_to_PA_dfs, ignore_index=True)
ahd_PR_to_WY_dfs = pd.concat(ahd_PR_to_WY_dfs, ignore_index=True)

# Concatenating the resulting DataFrames into one
ahd_df = pd.concat([ahd_AK_to_IA_dfs, ahd_ID_to_MP_dfs, ahd_MS_to_PA_dfs, ahd_PR_to_WY_dfs], ignore_index=True)

In [15]:
df_main = df_main.merge(ahd_df, on='State', how='inner')

In [16]:
df_main.rename(columns={'State': 'state_id'}, inplace=True)

In [17]:
# df_main.to_csv('df_main.csv', index=False)

### Adding FIPS

In [18]:
df_main.columns = [col.lower() for col in df_main.columns]

In [19]:
df_main['state']

0       Alabama
1       Alabama
2       Alabama
3       Alabama
4       Alabama
         ...
3859    Wyoming
3860    Wyoming
3861    Wyoming
3862    Wyoming
3863    Wyoming
Name: state, Length: 3864, dtype: object

In [20]:
df_fips = pd.read_csv('D:/UCLA/Capstone/HMS-MGH-Capstone-Project/datasets/uscities.csv')

In [21]:
df_fips['county_fips'] = df_fips['county_fips'].astype(str).apply(lambda x: x.zfill(5))

In [22]:
df_main_fips = df_main.merge(df_fips, on=['city', 'state_id'], how='inner')

In [23]:
df_main_fips[['hospital_name', 'county_fips']]

                             hospital_name county_fips
0                         Andalusia Health       01039
1     Ascension Saint Vincent's Birmingham       01073
2             Ascension St. Vincent's East       01073
3             Birmingham VA Medical Center       01073
4         Brookwood Baptist Medical Center       01073
...                                    ...         ...
3612                   Saint John's Health       56039
3613            Sheridan Memorial Hospital       56033
3614            Sheridan VA Medical Center       56033
3615                 Summit Medical Center       56025
3616                Wyoming Medical Center       56025

[3617 rows x 2 columns]

In [24]:
df_main_fips['county_fips']

0       01039
1       01073
2       01073
3       01073
4       01073
        ...
3612    56039
3613    56033
3614    56033
3615    56025
3616    56025
Name: county_fips, Length: 3617, dtype: object

In [25]:
df_main_fips.groupby('county_fips').agg({'staffed_beds': 'sum'})

            staffed_beds
county_fips
01001                 77
01003           48112141
01005                 47
01007                156
01011                 54
...                  ...
56025                242
56033                 71
56037                 58
56039                121
56041                 32

[1448 rows x 1 columns]

### Merging AHD with FIPS

In [26]:
df_ahd_fips = pd.read_csv('D:/UCLA/Capstone/HMS-MGH-Capstone-Project/datasets/AHD_data/ahd_fips.csv')

In [27]:
df_ahd_fips.rename(columns={'county_fips': 'fips'}, inplace=True)

In [28]:
df_ahd_fips['fips'] = df_ahd_fips['fips'].astype(str).apply(lambda x: x.zfill(5))

In [29]:
# adi
df_adi['FIPS'] = df_adi['FIPS'].astype(str).apply(lambda x: x.zfill(12))

In [30]:
df_adi['fips'] = df_adi['FIPS'].astype(str).str.slice(0, 5)

In [31]:
# Convert the columns to numeric, setting errors='coerce' to replace invalid values with NaN
df_adi['ADI_NATRANK'] = pd.to_numeric(df_adi['ADI_NATRANK'], errors='coerce')
df_adi['ADI_STATERNK'] = pd.to_numeric(df_adi['ADI_STATERNK'], errors='coerce')

# Drop rows containing NaN in either of the columns
df_adi = df_adi.dropna(subset=['ADI_NATRANK', 'ADI_STATERNK'])

In [32]:
df_adi = df_adi.groupby('fips').agg({'ADI_NATRANK':'mean', 'ADI_STATERNK': 'mean'})

In [33]:
# covid
df_county_cases = pd.read_csv('D:/UCLA/Capstone/HMS-MGH-Capstone-Project/datasets/covid_data/us_county_confirmed_cases.csv')
df_county_deaths = pd.read_csv('D:/UCLA/Capstone/HMS-MGH-Capstone-Project/datasets/covid_data/us_county_confirmed_deaths.csv')

In [34]:
df_county_cases.rename(columns={'countyFIPS': 'fips'}, inplace=True)
df_county_deaths.rename(columns={'countyFIPS': 'fips'}, inplace=True)

In [35]:
df_county_cases['fips'] = df_county_cases['fips'].astype(str).apply(lambda x: x.zfill(5))
df_county_deaths['fips'] = df_county_deaths['fips'].astype(str).apply(lambda x: x.zfill(5))

In [36]:
df_county_deaths = df_county_deaths.drop(columns=[
    'COUNTY', 'NAME', 'POP70', 'HHD70', 'POP80', 'HHD80',
    'POP90', 'HHD90', 'POP00', 'HHD00', 'POP10', 'HHD10',
    'County Name', 'State', 'StateFIPS'
])
df_county_cases_deaths = df_county_cases.merge(df_county_deaths, on='fips', how='inner')

In [37]:
# main
df_main = df_ahd_fips.merge(df_adi, on='fips', how='inner')

In [38]:
df_main

,Unnamed: 0,fips,population,density,Staffed_Beds,Total_Discharges,Patient_Days,Gross_Patient_Revenue,Hospitals,ADI_NATRANK,ADI_STATERNK
0,0,01001,3.797700e+04,399.100000,77,3049,15984,250284,1,66.977778,4.355556
1,1,01003,1.660633e+04,341.766667,301,18080,78361,2481966,3,51.534483,2.655172
2,2,01005,1.275300e+04,77.100000,47,1055,4571,76099,1,90.900000,7.950000
3,3,01007,2.789000e+03,107.300000,156,229,1053,31288,1,83.411765,6.647059
4,4,01011,3.389000e+03,201.800000,54,208,1317,42632,1,93.000000,8.888889
...,...,...,...,...,...,...,...,...,...,...,...
1460,1460,72113,1.003018e+05,1509.400000,948,34296,200612,511920,5,94.239669,6.867769
1461,1461,72127,1.915105e+06,2982.200000,1121,35954,244035,908658,11,78.114035,3.666667
1462,1462,72141,7.336000e+03,1540.300000,37,11,39,15825,1,96.727273,8.636364
1463,1463,72145,2.352700e+04,1431.800000,120,2005,14825,83269,1,92.114286,6.428571
1464,1464,72153,8.030700e+04,2065.000000,73,1775,8971,32708,1,96.280000,8.200000

In [39]:
df_main = df_main.merge(df_county_cases_deaths, on='fips', how='inner')

In [40]:
# y for deaths, x for cases
df_main

,Unnamed: 0,fips,population,density,Staffed_Beds,Total_Discharges,Patient_Days,Gross_Patient_Revenue,Hospitals,ADI_NATRANK,...,2023/4/8_y,2023/4/9_y,2023/4/10_y,2023/4/11_y,2023/4/12_y,2023/4/13_y,2023/4/14_y,2023/4/15_y,2023/4/16_y,2023/4/17_y
0,0,01001,37977.000000,399.100000,77,3049,15984,250284,1,66.977778,...,235.0,235.0,235.0,235.0,235.0,235.0,235.0,235.0,235.0,235.0
1,1,01003,16606.333333,341.766667,301,18080,78361,2481966,3,51.534483,...,731.0,731.0,731.0,731.0,731.0,731.0,731.0,731.0,731.0,731.0
2,2,01005,12753.000000,77.100000,47,1055,4571,76099,1,90.900000,...,104.0,104.0,104.0,104.0,104.0,104.0,104.0,104.0,104.0,104.0
3,3,01007,2789.000000,107.300000,156,229,1053,31288,1,83.411765,...,111.0,111.0,111.0,111.0,111.0,111.0,111.0,111.0,111.0,111.0
4,4,01011,3389.000000,201.800000,54,208,1317,42632,1,93.000000,...,54.0,54.0,54.0,54.0,54.0,54.0,54.0,54.0,54.0,54.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1442,1443,56025,63962.000000,845.500000,242,8416,43190,759814,2,50.962963,...,311.0,311.0,311.0,311.0,311.0,311.0,311.0,311.0,311.0,311.0
1443,1444,56033,18660.000000,546.000000,71,2524,9606,296755,2,38.681818,...,92.0,92.0,92.0,92.0,92.0,92.0,92.0,92.0,92.0,92.0
1444,1445,56037,23505.000000,454.200000,58,1279,4742,207720,2,54.088235,...,139.0,139.0,139.0,139.0,139.0,139.0,139.0,139.0,139.0,139.0
1445,1446,56039,10728.000000,1380.100000,121,1711,5932,273723,1,6.473684,...,16.0,16.0,16.0,16.0,16.0,16.0,16.0,16.0,16.0,16.0
1446,1447,56041,11802.000000,440.100000,32,803,1627,105109,1,57.058824,...,43.0,43.0,43.0,43.0,43.0,43.0,43.0,43.0,43.0,43.0

### Adding Socioeconomic Indicators

In [41]:
df_edu = pd.read_csv('D:/UCLA/Capstone/HMS-MGH-Capstone-Project/datasets/socioeconomic_indicators/Education.csv', encoding='ISO-8859-1')
df_poverty = pd.read_csv('D:/UCLA/Capstone/HMS-MGH-Capstone-Project/datasets/socioeconomic_indicators/PovertyEstimates.csv', encoding='ISO-8859-1')
df_unemployment = pd.read_csv('D:/UCLA/Capstone/HMS-MGH-Capstone-Project/datasets/socioeconomic_indicators/Unemployment.csv', encoding='ISO-8859-1')

In [42]:
df_edu.rename(columns={'Federal Information Processing Standard (FIPS) Code': 'fips'}, inplace=True)
df_poverty.rename(columns={'FIPS_Code': 'fips'}, inplace=True)
df_unemployment.rename(columns={'FIPS_Code': 'fips'}, inplace=True)

In [43]:
df_edu['fips']

0             0
1             0
2             0
3             0
4             0
          ...
169230    72153
169231    72153
169232    72153
169233    72153
169234    72153
Name: fips, Length: 169235, dtype: int64

In [44]:
df_edu = df_edu[df_edu['Value'] < 100]
df_poverty = df_poverty[df_poverty['Value'] < 100]
df_unemployment = df_unemployment[df_unemployment['Value'] < 100]

In [45]:
df_edu = df_edu.groupby('fips').agg({'Value':'mean'}).reset_index()
df_poverty = df_poverty.groupby('fips').agg({'Value':'mean'}).reset_index()
df_unemployment = df_unemployment.groupby('fips').agg({'Value':'mean'}).reset_index()

In [46]:
df_edu_pov = df_edu.merge(df_poverty, on='fips', how='inner', suffixes=('_education', '_poverty'))

In [47]:
df_edu_pov_unem = df_edu_pov.merge(df_unemployment, on='fips', how='inner')

In [48]:
df_edu_pov_unem.rename(columns={'Value': 'Value_unemployment'}, inplace=True)

In [49]:
df_edu_pov_unem['fips'] = df_edu_pov_unem['fips'].astype(str).apply(lambda x: x.zfill(5))

In [50]:
df_main = df_main.merge(df_edu_pov_unem, on='fips', how='inner')

In [54]:
df_main

,Unnamed: 0,fips,population,density,Staffed_Beds,Total_Discharges,Patient_Days,Gross_Patient_Revenue,Hospitals,ADI_NATRANK,...,2023/4/11_y,2023/4/12_y,2023/4/13_y,2023/4/14_y,2023/4/15_y,2023/4/16_y,2023/4/17_y,Value_education,Value_poverty,Value_unemployment
0,0,01001,37977.000000,399.100000,77,3049,15984,250284,1,66.977778,...,235.0,235.0,235.0,235.0,235.0,235.0,235.0,21.714286,10.400000,4.611538
1,1,01003,16606.333333,341.766667,301,18080,78361,2481966,3,51.534483,...,731.0,731.0,731.0,731.0,731.0,731.0,731.0,21.928571,10.861538,4.830769
2,2,01005,12753.000000,77.100000,47,1055,4571,76099,1,90.900000,...,104.0,104.0,104.0,104.0,104.0,104.0,104.0,22.285714,23.053846,9.800000
3,3,01007,2789.000000,107.300000,156,229,1053,31288,1,83.411765,...,111.0,111.0,111.0,111.0,111.0,111.0,111.0,21.571429,18.446154,8.814815
4,4,01011,3389.000000,201.800000,54,208,1317,42632,1,93.000000,...,54.0,54.0,54.0,54.0,54.0,54.0,54.0,22.285714,28.846154,9.951852
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1442,1443,56025,63962.000000,845.500000,242,8416,43190,759814,2,50.962963,...,311.0,311.0,311.0,311.0,311.0,311.0,311.0,21.782143,8.915385,7.833333
1443,1444,56033,18660.000000,546.000000,71,2524,9606,296755,2,38.681818,...,92.0,92.0,92.0,92.0,92.0,92.0,92.0,22.500000,9.069231,7.981481
1444,1445,56037,23505.000000,454.200000,58,1279,4742,207720,2,54.088235,...,139.0,139.0,139.0,139.0,139.0,139.0,139.0,22.360714,8.323077,4.438462
1445,1446,56039,10728.000000,1380.100000,121,1711,5932,273723,1,6.473684,...,16.0,16.0,16.0,16.0,16.0,16.0,16.0,22.496429,12.092857,4.176923
1446,1447,56041,11802.000000,440.100000,32,803,1627,105109,1,57.058824,...,43.0,43.0,43.0,43.0,43.0,43.0,43.0,22.500000,9.230769,4.723077

In [51]:
df_main.to_csv('df_main.csv', index=False)